adamkondraciuk/nrfx/mdk/nrf54h20_engb_flpr.svd
            <register>
              <name>CTL00</name>
              <description>This register contains fields that control the DMA transfer.</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x02504821</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>INTEN</name>
                  <description>Interrupt Enable Bit.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INTERRUPT_DISABLE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INTERRUPT_ENABLE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DSTTRWIDTH</name>
                  <description>Destination Transfer Width.</description>
                  <lsb>1</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DST_TR_WIDTH_0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DST_TR_WIDTH_1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DST_TR_WIDTH_2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DST_TR_WIDTH_3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DST_TR_WIDTH_4</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DST_TR_WIDTH_5</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DST_TR_WIDTH_6</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DST_TR_WIDTH_7</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSRCTRWIDTH</name>
                  <description>Reserved field - read-only</description>
                  <lsb>4</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DINC</name>
                  <description>Destination Address Increment.</description>
                  <lsb>7</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DINC_0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DINC_1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DINC_2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DINC_3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SINC</name>
                  <description>Source Address Increment.</description>
                  <lsb>9</lsb>
                  <msb>10</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SINC_0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SINC_1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SINC_2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SINC_3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DESTMSIZE</name>
                  <description>Destination Burst Transaction Length.</description>
                  <lsb>11</lsb>
                  <msb>13</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DEST_MSIZE_0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DEST_MSIZE_1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DEST_MSIZE_2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DEST_MSIZE_3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DEST_MSIZE_4</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DEST_MSIZE_5</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DEST_MSIZE_6</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DEST_MSIZE_7</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SRCMSIZE</name>
                  <description>Source Burst Transaction Length.</description>
                  <lsb>14</lsb>
                  <msb>16</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SRC_MSIZE_0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SRC_MSIZE_1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SRC_MSIZE_2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SRC_MSIZE_3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SRC_MSIZE_4</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SRC_MSIZE_5</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SRC_MSIZE_6</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SRC_MSIZE_7</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSRCGATHEREN</name>
                  <description>Reserved field - read-only</description>
                  <lsb>17</lsb>
                  <msb>17</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DSTSCATTEREN</name>
                  <description>Destination scatter enable.</description>
                  <lsb>18</lsb>
                  <msb>18</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DST_SCATTER_DISABLE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DST_SCATTER_ENABLE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDCTL</name>
                  <description>Reserved field - read-only</description>
                  <lsb>19</lsb>
                  <msb>19</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>TTFC</name>
                  <description>Transfer Type and Flow Control.</description>
                  <lsb>20</lsb>
                  <msb>22</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TT_FC_0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT_FC_1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT_FC_2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT_FC_3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT_FC_4</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT_FC_5</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT_FC_6</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT_FC_7</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDDMS</name>
                  <description>Reserved field - read-only</description>
                  <lsb>23</lsb>
                  <msb>24</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSMS</name>
                  <description>Reserved field - read-only</description>
                  <lsb>25</lsb>
                  <msb>26</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDLLPDSTEN</name>
                  <description>Reserved field - read-only</description>
                  <lsb>27</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDLLPSRCEN</name>
                  <description>Reserved field - read-only</description>
                  <lsb>28</lsb>
                  <msb>28</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVD1CTL</name>
                  <description>Reserved field - read-only</description>
                  <lsb>29</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>CTL01</name>
              <description>This register contains fields that control the DMA transfer.</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BLOCKTS</name>
                  <description>Block Transfer Size.</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>RSVD2CTL</name>
                  <description>Reserved field - read-only</description>
                  <lsb>5</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DONE</name>
                  <description>Done bit.</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
