adamkondraciuk/nrfx/mdk/nrf54h20_engb_flpr.svd
            <register>
              <name>DMACOMPPARAMS3L</name>
              <description>DMA_COMP_PARAMS_3 is a constant read-only register that contains encoded information about the component parameter settings for Channel 1 and Channel 2.</description>
              <addressOffset>0x048</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CH2DTW</name>
                  <description>The value of this register is derived from the DMAH_CH2_DTW coreConsultant parameter.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_PROGRAMMABLE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_8</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_16</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_32</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_64</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_128</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_256</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2STW</name>
                  <description>The value of this register is derived from the DMAH_CH2_STW coreConsultant parameter.</description>
                  <lsb>3</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_PROGRAMMABLE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_8</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_16</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_32</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_64</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_128</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANS_WIDTH_256</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2STATDST</name>
                  <description>The value of this register is derived from the DMAH_CH2_STAT_DST coreConsultant parameter.</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FALSE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRUE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2STATSRC</name>
                  <description>The value of this register is derived from the DMAH_CH2_STAT_SRC coreConsultant parameter.</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FALSE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRUE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2DSTSCAEN</name>
                  <description>The value of this register is derived from the DMAH_CH2_DST_SCA_EN coreConsultant parameter.</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FALSE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRUE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2SRCGATEN</name>
                  <description>The value of this register is derived from the DMAH_CH2_SRC_GAT_EN coreConsultant parameter.</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FALSE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRUE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2LOCKEN</name>
                  <description>The value of this register is derived from the DMAH_CH2_LOCK_EN coreConsultant parameter.</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FALSE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRUE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2MULTIBLKEN</name>
                  <description>The value of this register is derived from the DMAH_CH2_MULTI_BLK_EN coreConsultant parameter.</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FALSE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRUE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2CTLWBEN</name>
                  <description>The value of this register is derived from the DMAH_CH2_CTL_WB_EN coreConsultant parameter.</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FALSE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRUE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2HCLLP</name>
                  <description>The value of this register is derived from the DMAH_CH2_HC_LLP coreConsultant parameter.</description>
                  <lsb>13</lsb>
                  <msb>13</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>PROGRAMMABLE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HARDCODED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2FC</name>
                  <description>The value of this register is derived from the DMAH_CH2_FC coreConsultant parameter.</description>
                  <lsb>14</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FC_DMA</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FC_SRC</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FC_DST</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FC_ANY</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2MAXMULTSIZE</name>
                  <description>The value of this register is derived from the DMAH_CH2_MULT_SIZE coreConsultant parameter.</description>
                  <lsb>16</lsb>
                  <msb>18</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MAX_MULT_SIZE_4</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_MULT_SIZE_8</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_MULT_SIZE_16</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_MULT_SIZE_32</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_MULT_SIZE_64</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_MULT_SIZE_128</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MAX_MULT_SIZE_256</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2DMS</name>
                  <description>The value of this register is derived from the DMAH_CH2_DMS coreConsultant parameter.</description>
                  <lsb>19</lsb>
                  <msb>21</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASTER_1</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER_2</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER_3</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER_4</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PROGRAMMABLE</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2LMS</name>
                  <description>The value of this register is derived from the DMAH_CH2_LMS coreConsultant parameter.</description>
                  <lsb>22</lsb>
                  <msb>24</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASTER_1</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER_2</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER_3</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER_4</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PROGRAMMALE</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2SMS</name>
                  <description>The value of this register is derived from the DMAH_CH2_SMS coreConsultant parameter.</description>
                  <lsb>25</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASTER_1</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER_2</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER_3</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER_4</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PROGRAMMALE</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH2FIFODEPTH</name>
                  <description>The value of this register is derived from the DMAH_CH2_FIFO_DEPTH coreConsultant parameter.</description>
                  <lsb>28</lsb>
                  <msb>30</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FIFO_DEPTH_8</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FIFO_DEPTH_16</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FIFO_DEPTH_32</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FIFO_DEPTH_64</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FIFO_DEPTH_128</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FIFO_DEPTH_256</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
