adamkondraciuk/nrfx/mdk/nrf54h20_engb_flpr.svd
          <register>
            <name>INPUTOVERRIDE</name>
            <description>Enables overriding of the input signals to the PHY, used for PHY Built In Self Test (BIST).</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable or disable overriding of PHY input signals.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OVERRIDEVALUES</name>
            <description>Values that are used to override the input signals to the PHY.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x06000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATAIN0</name>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>DATAINH0</name>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TXVALID0</name>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>TXVALIDH0</name>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>OPMODE0</name>
                <lsb>18</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>XCVRSEL0</name>
                <lsb>20</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>TERMSEL0</name>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>DPPULLDOWN0</name>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DMPULLDOWN0</name>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>SUSPENDM0</name>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>SLEEPM0</name>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>BYPASSSEL0</name>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>BYPASSDPEN0</name>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>BYPASSDPDATA0</name>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DFT</name>
          <description>Unspecified</description>
          <headerStructName>USBHS_DFT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>ATB0CONFIG</name>
            <description>Analog Test Bus 0 (ATB0) configuration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable ANALOGTEST on the analog test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Analog test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Analog test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ATB1CONFIG</name>
            <description>Analog Test Bus 1 (ATB1) configuration</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable ANALOGTESTATE on the analog test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Analog test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Analog test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DTBCONFIG</name>
            <description>Digital Test Bus configuration</description>
            <addressOffset>0x10</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DTB0EN</name>
                <description>Enable TESTDATAOUT[0] on DTB0</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DTB1EN</name>
                <description>Enable TESTDATAOUT[1] on DTB1</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DTB2EN</name>
                <description>Enable TESTDATAOUT[2] on DTB2</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DTB3EN</name>
                <description>Enable TESTDATAOUT[3] on DTB3</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCFG</name>
            <description>Test mode configuration</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ATERESET</name>
                <description>ATE reset input. Disables PHYCLOCK0 and FREECLK</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clockenabled</name>
                    <description>PHYCLK0 and FREECLK enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clockdisabled</name>
                    <description>PHYCLK0 and FREECLK disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SIDDQ</name>
                <description>IDDQ Test Enable</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Analog blocks are powered up</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Analog blocks are powered down</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VATESTENB</name>
                <description>Analog Test Pin Select</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Analog test voltages cannot be viewed or applied</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ID0</name>
                    <description>Analog test voltages cannot be viewed or applied on ID0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ANALOGTEST</name>
                    <description>Analog test voltages cannot be viewed or applied on ANALOGTEST</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unused</name>
                    <description>Invalid setting</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOOPBACKENB0</name>
                <description>Loopback Test. enables receive and transmit logic concurrently</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>During data transmission, the receive logic is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>During data transmission, the receive logic is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TESTBURNIN</name>
                <description>Burn-In Test Enable</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Burn-in test disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Burn-in test enabled. Requires 50MHz reference clock on CLKCORE</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TESTIFENABLE</name>
                <description>Enable the test interface.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Test interface synchronizer clock disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Test interface synchronizer clock enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTADDR</name>
            <description>Test data address</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTADDR0</name>
                <description>Test Interface Register Address</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTDATAIN</name>
            <description>Test data input</description>
            <addressOffset>0x38</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATAIN0</name>
                <description>Test Data Write Bus</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTDATAOUTSEL</name>
            <description>Test data out select</description>
            <addressOffset>0x3C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATAOUTSEL0</name>
                <description>Determines which signals appear on TESDATAOUT</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>InternalSignal</name>
                    <description>Mode-defined, internally generated signals are output</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TestRegister</name>
                    <description>Mode-defined test register contents are output</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTDATAOUT</name>
            <description>Test data output</description>
            <addressOffset>0x40</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATAOUT0</name>
                <description>Test Data Read Bus</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TLATCH</name>
            <description>Test data latch</description>
            <addressOffset>0x44</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTCLK0</name>
                <description>PHY uses the positive edge of TESTCLK0 to latch TESTDATAIN[7:0]</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
