adamkondraciuk/nrfx/mdk/nrf54h20_engb_flpr.svd
    <peripheral derivedFrom="GLOBAL_PWM120">
      <name>GLOBAL_PWM133</name>
      <description>Pulse width modulation unit 4</description>
      <baseAddress>0x5F9D4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM133</name>
        <value>468</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM136</name>
      <description>Serial Peripheral Interface Master with EasyDMA 8</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS136</name>
      <description>SPI Slave 7</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM136</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 6</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS136</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 6</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE136</name>
      <description>UART with EasyDMA 7</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM137</name>
      <description>Serial Peripheral Interface Master with EasyDMA 9</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS137</name>
      <description>SPI Slave 8</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM137</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 7</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS137</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 7</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE137</name>
      <description>UART with EasyDMA 8</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>